# -*- coding: utf-8 -*-
__author__= 'Kozlov Aleksandr Anatiolevich'

# Задание-1:
# Матрицы в питоне реализуются в виде вложенных списков:
# Пример. Дано:

matr = [[1,2,3],[4,5,6],[7,8,9]]

# Выполнить поворот (транспонирование) матрицы
# Пример. Результат:
# matrix_rotate = [[1, 3, 0],
#                  [0, 4, 4],
#                  [8, 1, 2]]

# Суть сложности hard: Решите задачу в одну строку

"""matr_transponse = map(list, zip(*matr))
for line in matr_transponse:
    print(line)"""

# Задание-2:
# Найдите наибольшее произведение пяти последовательных цифр в 1000-значном числе.
# Выведите произведение и индекс смещения первого числа последовательных 5-ти цифр.
# Пример 1000-значного числа:

number = "731671765313306249192251196744265747423" \
         "553491949349698352031277450632623957831" \
         "801698480186947885184385861560789112949" \
         "495459501737958331952853208805511125406" \
         "987471585238630507156932909632952274430" \
         "355766896648950445244523161731856403098" \
         "711121722383113622298934233803081353362" \
         "766142828064444866452387493035890729629" \
         "049156044077239071381051585930796086670" \
         "172427121883998797908792274921901699720" \
         "888093776657273330010533678812202354218" \
         "097512545405947522435258490771167055601" \
         "360483958644670632441572215539753697817" \
         "977846174064955149290862569321978468622" \
         "482839722413756570560574902614079729686" \
         "524145351004748216637048440319989000889" \
         "524345065854122758866688116427171479924" \
         "442928230863465674813919123162824586178" \
         "664583591245665294765456828489128831426" \
         "076900422421902267105562632111110937054" \
         "421750694165896040807198403850962455444" \
         "362981230987879927244284909188845801561" \
         "660979191338754992005240636899125607176" \
         "060588611646710940507754100225698315520" \
         "005593572972571636269561882670428252483" \
         "600823257530420752963450"
max = 0
i = 4
while i < len(number): # есть небольшая помарка, я взял 999 цифр(1 удалил случайно)
    next_max = 1
    for j in range(5):
        next_max *= int(number[i - j])
    if next_max > max:
        max = next_max
        index = i - 4
    i += 1
print(max)
print(index)
print(len(number))



